In [76]:
import pandas as pd 
import numpy as np

In [77]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [78]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

## working with Date

In [79]:
date['date'] = pd.to_datetime(date['date'])

In [80]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [81]:
date['year'] = date['date'].dt.year
date.head(2)

        date  product_id  city_id  orders  year
0 2019-12-10        5628       25       3  2019
1 2018-08-15        3646       14     157  2018

In [82]:
date['month'] = date['date'].dt.month_name()

In [83]:
date['day'] = date['date'].dt.day

In [84]:
date['week'] = date['date'].dt.dayofweek

In [85]:
date['quarter'] = date['date'].dt.quarter

In [86]:
date['day_name'] = date['date'].dt.day_name()

In [87]:
date

,date,product_id,city_id,orders,year,month,day,week,quarter,day_name
0,2019-12-10,5628,25,3,2019,December,10,1,4,Tuesday
1,2018-08-15,3646,14,157,2018,August,15,2,3,Wednesday
2,2018-10-23,1859,25,1,2018,October,23,1,4,Tuesday
3,2019-08-17,7292,25,1,2019,August,17,5,3,Saturday
4,2019-01-06,4344,25,3,2019,January,6,6,1,Sunday
...,...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,2018,October,8,0,4,Monday
996,2018-12-06,5521,7,1,2018,December,6,3,4,Thursday
997,2019-05-07,487,26,14,2019,May,7,1,2,Tuesday
998,2019-03-03,1503,21,2,2019,March,3,6,1,Sunday
999,2019-10-15,6371,7,22,2019,October,15,1,4,Tuesday

In [88]:
date['holiday'] = np.where(date['day_name'].isin(['Sunday', 'Saturday']), 1, 0)

In [89]:
date

,date,product_id,city_id,orders,year,month,day,week,quarter,day_name,holiday
0,2019-12-10,5628,25,3,2019,December,10,1,4,Tuesday,0
1,2018-08-15,3646,14,157,2018,August,15,2,3,Wednesday,0
2,2018-10-23,1859,25,1,2018,October,23,1,4,Tuesday,0
3,2019-08-17,7292,25,1,2019,August,17,5,3,Saturday,1
4,2019-01-06,4344,25,3,2019,January,6,6,1,Sunday,1
...,...,...,...,...,...,...,...,...,...,...,...
995,2018-10-08,255,13,1,2018,October,8,0,4,Monday,0
996,2018-12-06,5521,7,1,2018,December,6,3,4,Thursday,0
997,2019-05-07,487,26,14,2019,May,7,1,2,Tuesday,0
998,2019-03-03,1503,21,2,2019,March,3,6,1,Sunday,1
999,2019-10-15,6371,7,22,2019,October,15,1,4,Tuesday,0

## working with time

In [90]:
time.head(3)

                  date                                               msg
0  2013-12-15 00:50:00                          ищу на сегодня мужика 37
1  2014-04-29 23:40:00  ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00          Днепр.м 43 позн.с д/ж *.о  067.16.34.576

In [92]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [93]:
time['date'] = pd.to_datetime(time['date'])

In [95]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [97]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0